app/views/gossips/index.html.erb

   <div class="fondiv" >
        <h3 class="card-title"><%= gossip.user.first_name %></h3>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]