app/views/gossips/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <div class="card-header">
      <%= @gossip.user.first_name %> <%= @gossip.user.last_name %>