app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @user = User.all
    @gossip = Gossip.all

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dhjkdgh"], ["content", "fghhs"], ["user_id", 4], ["created_at", "2019-08-13 13:15:29.989165"], ["updated_at", "2019-08-13 13:15:29.989165"]]
---
  def create
    @gossip = Gossip.new(title: params[:title], content: params[:content], user_id: 4) # avec xxx qui sont les données obtenues à partir du formulaire
  if @gossip.save # essaie de sauvegarder en base @gossip